Repository: mondeja/mkdocs-mdpo-plugin
Catalog: docs/*/config.md.po
Languages: es

source: Always put `mdpo` plugin in `mkdocs.yml` file after other plugins which could edit the content of your files:
es: Siempre coloca el plugin `mdpo` en el archivo `mkdocs.yml` después de otros plugins que pudieran editar el contenido de tus archivos:

source: Directory inside your documentation where the PO translation files will be placed. If not defined, the root of `docs` (`docs_dir` setting) will be used, so the default layout would be something like:
es: Directorio dentro de tu documentación donde los archivos PO de traducción serán colocados. Si no se define, se usará la raíz de `docs` (configuración `docs_dir`), por lo que la estructura por defecto sería algo como:

source: The default value is `{{language}}/{{page.file.dest_path}}`, being `page` the original documentation page and `language` the language of the translation.
es: El valor por defecto es `{{language}}/{{page.file.dest_path}}`, siendo `page` la página de documentación original y `language` el idioma de la traducción.

source: The context for the template includes:
es: El contexto para la plantilla incluye:

source: All the configuration settings of the plugin such as `languages`, `default_language`, `lc_messages`, `locale_dir`, `dest_filename_template` itself...
es: Todos los ajustes de configuración del plugin, como `languages`, `default_language`, `lc_messages`, `locale_dir`, `dest_filename_template`...

source: Languages
es: Idiomas

source: Layout
es: Estructura

source: Original language of your files. If not defined, the first language found in [`languages`](#languages-list) will be used.
es: Idioma original de tus archivos. Si no se define se usará el primer idioma encontrado en [`languages`](#languages-list).

source: Defining it to `locale`, the layout will change a bit, but this doesn't mean that this new `locale/` folder will be included in the `site/` directory (see [`dest_filename_template`](#dest_filename_template-str)).
es: Definiéndolo a `locale`, la estructura cambiará un poco, pero esto no significa que esta nueva carpeta `locale/` será incluida en el directorio `site/` (ver [`dest_filename_template`](#dest_filename_template-str)).

source: In the world of program translation is common the creation of a `LC_MESSAGES/` folder inside the language directory. If you need it you can set this setting as `true`, but if you want another folder name, you can pass a string, or even a relative path to create more than one folder between the language directory and their content:
es: En el mundo de la traducción de programas es común la creación de una carpeta `LC_MESSAGES` dentro del directorio de idioma. Si la necesitas, puedes definir este ajuste como `true`, pero si quieres otro nombre de carpeta, puedes pasar una cadena, o incluso una ruta relativa para crear más de una carpeta entre el directorio de idioma y su contenido:

source: Custom value
es: Valor personalizado

source: Documentation directories tree
es: Árbol de directorios de documentación

source: `language`: Translation language for the page.
es: `language`: Idioma de traducción para la página.

source: `page`: The original Markdown page object inside your documentation directory.
es: `page`: El objeto de la página Markdown original dentro de tu directorio de documentación.

source: `po_filepath`: The path of the PO file wich contains the translations.
es: `po_filepath`: La ruta del archivo PO el cual contiene las traducciones.

source: File extensions that are ignored from being added to site directory, defaults to `['.po', '.pot', '.mo']`.
es: Extensiones de archivos que son ignorados de ser añadidos al directorio del sitio, por defecto `['.po', '.pot', '.mo']`.

source: Languages to translate your files into. Commonly defined as [ISO 639 codes][iso-369].
es: Idiomas a los que traducir tus archivos. Comúnmente definidos como [códigos ISO 639][iso-369].

source: [iso-369]: https://en.wikipedia.org/wiki/ISO_639
es: [iso-369]: https://es.wikipedia.org/wiki/ISO_639

source: Template for destination file name inside `site/` directory. This is a valid [Jinja2 template][jinja2-template] string that will be used to define where should be placed the generated translated file inside the `site/` directory.
es: Plantilla para el nombre del archivo destino dentro del directorio `site/`. Esto es una cadena para una plantilla [Jinja2 template][jinja2-template] válida que será usada para definir donde debe ser colocado el archivo traducido generado dentro del directorio `site/`.

source: `po`: A [`polib.POFile`][polib.POFile] object with the translations loaded.
es: `po`: Un objeto [`polib.POFile`][polib.POFile] con las traducciones cargadas.

source: If you are using [mkdocs-material][mkdocs-material] theme, can also be defined in the `theme.language` configuration setting (see [Site language][mkdocs-material-site-language]).
es: Si estás usando el tema [mkdocs-material][mkdocs-material], también puede ser definido en el ajuste de configuración `theme.language` (ver [Selector de idioma][mkdocs-material-site-language]).

source: If you are using [mkdocs-material][mkdocs-material] theme, can also be defined in the `extra.alternate` configuration setting (see [Site language selector][mkdocs-material-site-language-selector]).
es: Si estás usando el tema [mkdocs-material][mkdocs-material], también puede ser definido en el ajuste de configuración `extra.alternate` (ver [Selector de idioma][mkdocs-material-site-language-selector]).

source: Configuration
es: Configuración

source: You can ignore certain messages from being dumped into PO files adding them to this list.
es: Puedes ignorar ciertos mensajes de ser volcados a los archivos PO añadiéndolos a esta lista.
