Repository: mondeja/mkdocs-mdpo-plugin
Catalog: docs/*/index.md.po
Languages: es

source: Home
es: Inicio

source: Install
es: Instalación

source: Enable the plugin in your `mkdocs.yml`:
es: Habilita el plugin en tu `mkdocs.yml`:

source: Minimal configuration
es: Configuración mínima

source: Standalone
es: Por separado

source: Both previous configurations will create the same layout of files building the documentation. Given the next layout in a `docs/` directory:
es: Ambas configuraciones previas crearán la misma estructura de archivos construyendo la documentación. Dada la siguiente estructura en un directorio `docs/`:

source: After the build, you will get:
es: Después de la construcción, obtendrás:

source: Just translate the strings in `docs/es/index.md.po` into Spanish, build again with `mkdocs build` and the `site/` directory will look like:
es: Simplemente traduce las cadenas en `docs/es/index.md.po` al español, construye de nuevo con `mkdocs build` y el directorio `site/` se verá tal que:

source: Usage
es: Uso

source: Known limitations
es: Limitaciones conocidas

source: With [mkdocs-material](https://squidfunk.github.io/mkdocs-material)
es: Con [mkdocs-material](https://squidfunk.github.io/mkdocs-material)

source: plugins: - mdpo: languages: - en # first language is the original - es
es: plugins: - mdpo: languages: - en # el primer idioma es el original - es

source: Translations for Mkdocs using PO files, fully customizable. Compatible with [mkdocs-material](https://squidfunk.github.io/mkdocs-material), based on [mdpo][mdpo-docs].
es: Traducciones para Mkdocs usando archivos PO, totalmente personalizable. Compatible con [mkdocs-material](https://squidfunk.github.io/mkdocs-material), basado en [mdpo][mdpo-docs].

source: How does it works
es: Cómo funciona

source: **mkdocs-mdpo-plugin** is based in [mdpo][mdpo-docs] which is a program to translate [CommonMark][commonmark] compliant Markdown content using PO files.
es: **mkdocs-mdpo-plugin** está basado en [mdpo][mdpo-docs] el cual es un programa para traducir contenido Markdown complaciente con [CommonMark][commonmark] usando archivos PO.

source: Tip
es: Consejo

source: See also [the traditional approach for Markdown translations][mdpo-traditional-approach-docs] and [mdpo approach][mdpo-approach-docs].
es: Ver también [la aproximación tradicional para traducciones Markdown (inglés)][mdpo-traditional-approach-docs] y [la aproximación mdpo (inglés)][mdpo-approach-docs].

source: Currently, edited messages are not marked as fuzzy like [xgtettext][xgettext-docs] does.
es: Actualmente, los mensajes editados no son marcados como fuzzy como hace [xgtettext][xgettext-docs].

source: The command `mkdocs serve` doesn't work.
es: El comando `mkdocs serve` no funciona.

source: As with [mkdocs][mkdocs-docs] you write [Python-Markdown][python-markdown-docs]'s implementation of Markdown, **mkdocs-mdpo-plugin** uses the [`xml.etree.ElementTree`][xml.etree.ElementTree] to translate the rest messages of custom HTML created by the [extensions][python-markdown-extensions-docs]. This is the reason why for some of them the translation process must be adjusted somewhat to be supported correctly (see [Extensions support][extensions-support-official]).
es: Ya que con [mkdocs][mkdocs-docs] escribes la implementación Markdown de [Python-Markdown][python-markdown-docs], **mkdocs-mdpo-plugin** usa el [`xml.etree.ElementTree`][xml.etree.ElementTree] para traducir el resto de mensajes del HTML personalizado creado por las [extensiones][python-markdown-extensions-docs]. Esta es la razón por la que activando algunas de ellas el proceso de traducción debe ser ajustado algo para poder ser soportadas correctamente (ver [Soporte de extensiones][extensions-support-official]).

source: Immprove the mkdocs-material's language selector
es: Mejora el selector de idioma de mkdocs-material

source: Github Pages configuration
es: Configuración para Github Pages

source: Custom root domain configuration
es: Configuración con dominio raíz personalizado

source: If you are using the [mkdocs-material theme][mkdocs-material], you can install the [`mkdocs-material-relative-language-selector` plugin][mmrls] to make relative links between languages inside the same page and remove the current displayed language from the language selector:
es: Si estás usando el [tema de mkdocs-material][mkdocs-material], puedes instalar el [plugin `mkdocs-material-relative-language-selector`][mmrls] para hacer relativos los links entre idiomas dentro de la misma página y eliminar el idioma actualmente desplegado del selector de idiomas:

source: Projects using mkdocs-mdpo-plugin
es: Proyectos usando mkdocs-mdpo-plugin

source: [hrcgen-docs]: https://hrcgen.ml
es: [hrcgen-docs]: https://hrcgen.ml/es/
