Repository: mondeja/mkdocs-mdpo-plugin
Catalog: docs/locale/*/useful-recipes.md.po
Languages: es

source: Useful recipes
es: Recetas útiles

source: pre-commit PO hooks
es: Hooks PO para pre-commit

source: You can use [pre-commit-po-hooks] to check for untranslated, obsolete and fuzzy messages before each commit.
es: Puedes usar [pre-commit-po-hooks] para comprobar por mensajes no traducidos, obsoletos o confusos (marcados como `, fuzzy`) antes de cada commit.

source: Example output
es: Salida de ejemplo

source: Simple README file translation with pre-commit
es: Traducción simple de archivo README con pre-commit

source: `md2po2md` command line interface
es: Interfaz de línea de comandos `md2po2md`

source: pre-commit hook configuration
es: Configuración de hook pre-commit

source: Github Pages configuration
es: Configuración para Github Pages

source: Custom root domain configuration
es: Configuración con dominio raíz personalizado

source: Relative mkdocs-material's language selector
es: Selector de idioma de mkdocs-material relativo

source: If you are using the [mkdocs-material theme][mkdocs-material], you can install the [`mkdocs-material-relative-language-selector` plugin][mmrls] to make relative links between languages inside the same page and remove the current displayed language from the language selector:
es: Si estás usando el [tema de mkdocs-material][mkdocs-material], puedes instalar el [plugin `mkdocs-material-relative-language-selector`][mmrls] para hacer relativos los links entre idiomas dentro de la misma página y eliminar el idioma actualmente desplegado del selector de idiomas:

source: [mdpo] is the core of **mkdocs-mdpo-plugin**. The package contains a set of programs to translate Markdown files using [PO files][po-files], so you can use them directly [as a command line interface][mdpo-cli] or through is [pre-commit hooks][mdpo-pre-commit].
es: [mdpo] es el núcleo de **mkdocs-mdpo-plugin**. El paquete contiene un conjunto de programas para traducir archivos Markdown usando [archivos PO][po-files], así que puedes usarlos directamente como una [interfaz de línea de comandos][mdpo-cli] o mediante sus [hooks pre-commit][mdpo-pre-commit].

source: ``` 📁 locale ├── 📁 es │ ├── 📄 README.md │ └── 📄 README.md.po └── 📁 fr ├── 📄 README.md └── 📄 README.md.po 📄 README.md <-- only existing file before execution ```
es: ``` 📁 locale ├── 📁 es │ ├── 📄 README.md │ └── 📄 README.md.po └── 📁 fr ├── 📄 README.md └── 📄 README.md.po 📄 README.md <-- único archivo existente antes de la ejecución ```
